early_api/app/controllers/abilities_controller.rb

  def index
    @abilities = Ability.all
---
SELECT "abilities".* FROM "abilities"

  def update
    @ability = Ability.where(child_id: params[:child_id], skill_id: params[:skill_id])
    if @ability.update(status: params[:status])
---
SELECT "abilities".* FROM "abilities" WHERE "abilities"."child_id" = $1 AND "abilities"."skill_id" = $2  [["child_id", 1], ["skill_id", 2]]
UPDATE "abilities" SET "status" = $1, "updated_at" = $2 WHERE "abilities"."id" = $3  [["status", true], ["updated_at", "2020-08-12 15:49:33.259151"], ["id", 2]]

    def set_ability
      @ability = Ability.find(params[:id])
---
SELECT "abilities".* FROM "abilities" WHERE "abilities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]