early_api/app/controllers/caregivers_controller.rb

  def index
    @caregivers = Caregiver.all
---
SELECT "caregivers".* FROM "caregivers"