early_api/app/controllers/families_controller.rb

  def index
    @families = Family.all
---
SELECT "families".* FROM "families"